Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ། ཁྱིམ་བདག་ལུག་དང་། ལུག་གི་མཆིས་འབྲང་དང་། ལུག་གི་བུ་དང་། ལུག་གི་མནའ་མ་དང་། ལུག་གི་བྲན་ཕོ་དང་། ལུག་གི་བྲན་མོས་ལས་ཅི་ཞིག་བགྱིས་ན། དེས་ན་དེ་དྲུག་བསོད་ནམས་ཆེན་པོར་གྱུར་ཅིང་། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བདེན་པ་མཐོང་ནས་འདི་དག་གིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཀྱི་མ་མཉེས་པར་ནི་མ་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did Miṇḍhaka and his wife, son, daughter-in-law, male slave, and female slave create that matured to cause these six to have great merit, see the truth in the presence of the Blessed One, and please the Blessed One and not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་དག་ཉིད་ཀྱིས་ལས་རྣམས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་ཞེས་བྱ་བ་ནས་འབྲས་བུ་དག་ཏུ་འགྱུར་བ་ཉིད་ཅེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Monks,” the Blessed one replied, “the actions were performed and accumulated by these people themselves, accruing a heap of karma, . . . . “ . . . They bear fruit in embodied beings.

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་དུ་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་རྒྱལ་སྲིད་བྱེད་དུ་འཇུག་གོ། །དེའི་ཚེ་བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་དུ་ལྟས་མཁན་རྣམས་ཀྱིས་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབབ་པས་ཐུར་མས་འཚོ་བའི་མུ་གེ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ།
en: “Monks, once in the city of Vārāṇasī a king named Brahmadatta was ruling over the country. At that time, astrologers predicted a twelve-year drought in Vārāṇasī, saying, ‘There will be a great famine of “living by means of a stick.” ’

source: །མུ་གེ་རྣམ་པ་གསུམ་ནི་ཟ་མ་ཏོག་དང་། རུས་གོང་དཀར་པོ་དང་། ཐུར་མས་འཚོ་བའོ། །དེ་ལ་ཟ་མ་ཏོག་ཅེས་བྱ་བ་ནི་ཟ་མ་ཏོག་དེའི་ནང་དུ་མི་རྣམས་ཀྱིས་འབྲུ་དག་བླུགས་ཏེ། མ་འོངས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་བཞག་ནས་བདག་ཅག་ཤི་ནས་འབྲུ་འདིས་མི་དེ་དག་གི་བྱ་བ་བྱེད་པར་འགྱུར་རོ་སྙམ་པ་སྟེ། འདི་ནི་ཟ་མ་ཏོག་དང་འབྲེལ་བས་ཟ་མ་ཏོག་ཅེས་བྱའོ། །རུས་གོང་དཀར་པོ་གང་ཞེ་ན།
en: “There are three types of famine, namely, ‘basket,’ ‘white bones,’ and ‘living by means of a stick.’ Among these, ‘basket’ means that people fill a basket with seeds and put it aside for the sake of future beings and think, ‘After our death, these seeds will help those people.’ As this type of famine is related to a basket, it is called ‘basket.’ What is ‘white bones’?

source: དུས་དེ་ན་མི་རྣམས་ཀྱི་རུས་པ་དག་བསྡུས་ནས་རེ་ཞིག་བཙོས་ཏེ། ཇི་ཙམ་ན་རུས་པ་དེ་དཀར་པོར་གྱུར་པ་དང་། དེ་ནས་དེའི་ཁུ་བ་འཐུང་བ་སྟེ།
en: At that time people collect bones, boil them until they become white, and then drink the liquid.

source: འདི་ནི་རུས་གོང་དཀར་པོ་དང་འབྲེལ་བས་རུས་གོང་དཀར་པོ་ཞེས་བྱའོ། །ཐུར་མས་འཚོ་བ་གང་ཞེ་ན།
en: As this type of famine is related to white bones, it is called ‘white bones.’ What is ‘living by means of a stick’?

source: དུས་དེ་ན་མི་རྣམས་ཀྱིས་གཡུལ་གྱི་སེར་ག་ནས་འབྲུའི་འབྲུམ་བུ་དག་ཐུར་མས་བྲུས་ནས་ཆུ་མང་པོའི་སྣོད་དུ་བཙོས་ནས་འཐུང་བ་སྟེ།
en: At that time people dig lumps of grains with a stick out of a hole in a granary, boil them in a pot filled with much water, and drink the water.

source: འདི་ནི་ཐུར་མ་དང་འབྲེལ་བས་ཐུར་མས་འཚོ་བ་ཞེས་བྱའོ།
en: As this type of famine is related to a stick, it is called ‘living by means of a stick.’

source: །དེ་ནས་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་བཱ་རཱ་ཎ་སཱིར་དྲིལ་སྒྲོགས་སུ་བཅུག་པ།
en: “Thereupon King Brahmadatta proclaimed with the ringing of bells in Vārāṇasī, ‘Listen, citizens living in my country!

source: བཱ་རཱ་ཎ་སཱི་ན་གནས་པའི་ཤེས་ལྡན་གྲོང་ཁྱེར་པ་དག་ཉོན་ཅིག །ལྟས་མཁན་རྣམས་ཀྱིས་ལོ་བཅུ་གཉིས་སུ་ཆར་མི་འབབ་པས་ཟ་མ་ཏོག་དང་། རུས་གོང་དཀར་པོ་དང་། ཐུར་མས་འཚོ་བའི་མུ་གེ་འབྱུང་བར་ལུང་བསྟན་གྱིས།
en: Astrologers have predicted that because of a twelve-year drought there will be a great famine of “basket,” “white bones,” and “living by means of a stick.” Whoever among you has food for twelve years should stay.

source: ཁྱེད་ལས་གང་དག་ལོ་བཅུ་གཉིས་ཀྱི་བཟའ་བ་ཡོད་པ་དེ་རྣམས་ནི་འཁོད་ཅིག །གང་དག་ལ་མེད་པ་དེ་དག་ནི་གར་དགའ་བར་དེང་ལ་མུ་གེ་མེད་ཅིང་ལོ་ལེགས་པར་གྱུར་ནས་སླར་གཤེགས་ཤིག །དེའི་ཚེ་ན་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་བ།
en: Those who do not should go anywhere they like and come back when there is no famine but an abundant harvest.’

source: ལོངས་སྤྱོད་ཆེ་བ། འཁོར་ཡངས་ཤིང་རྒྱ་ཆེ་བ་ཞིག་ཡོད་དེ།
en: “At that time there was a householder in Vārāṇasī who was rich and had great wealth, many possessions, and a large family.

source: དེས་མངན་བཀུག་སྟེ་སྨྲས་པ། ཀྱེ་ནང་རྗེ་ཁོ་བོ་འཁོར་དང་བཅས་པའི་ལོ་བཅུ་གཉིས་ཀྱི་བཟའ་བ་ཡོད་དམ།
en: He called the storehouse keeper and asked, ‘My good man, is there enough food for me and my attendants to survive for twelve years?’

source: དེས་སྨྲས་པ། དཔོན་པོ་མཆིས་སོ།
en: “ ‘Yes, there is, Master,’ the storehouse keeper answered.

source: །དེ་དེ་ཉིད་ན་གནས་པ་ལས་མུ་གེ་དེ་བརྒྱུད་མ་ཁོ་ནར་བྱུང་བས་དེའི་བང་མཛོད་རྣམས་ཡོངས་སུ་ཟད་པས་འཁོར་གྱི་སྐྱེ་བོ་ཐམས་ཅད་ཤི་བར་གྱུར་ཏེ་བདག་ཉིད་དང་དྲུག་ཅིག་ལུས་སོ།
en: “And so he stayed. However, famines occurred continuously, and his storehouses became exhausted. All his attendants died, and only six people including himself survived.

source: །དེ་ནས་ཁྱིམ་བདག་དེས་བང་མཛོད་རྣམས་ཕྱགས་པ་ལས། འབྲས་བྲེའུ་ཆུང་གང་ཞིག་བྱུང་ནས།
en: When the householder then swept his storehouses, he obtained one prastha of grains.

source: དེའི་ཆུང་མས་སྣོད་དུ་བླུགས་ཏེ་བཙོས་སོ།
en: His wife poured it into a pot and boiled it.

source: །སངས་རྒྱས་རྣམས་འབྱུང་བ་མེད་པ་ན་རང་སངས་རྒྱས་ཞེས་བྱ་བ་ནས། འཇིག་རྟེན་གྱི་ཡོན་གནས་གཅིག་པུ་དག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་བ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “When the buddhas do not appear, there appear self-awakened ones as the only fields of merit in the world . . . . At that time a certain self-awakened one arrived at Vārāṇasī, having traveled in the country.

source: །ཇི་ཙམ་ན་རང་སངས་རྒྱས་ཞིག་ལྗོངས་རྒྱུ་ཞིང་སོང་བ་དང་བཱ་རཱ་ཎ་སཱིར་ཕྱིན་ནས་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་བཱ་རཱ་ཎ་སཱིར་བསོད་སྙོམས་ལ་ཞུགས་པ་ན་ཁྱིམ་བདག་དེས་ཀྱང་བཟའ་བ་བསྡོགས་པ་དང་། རང་སངས་རྒྱས་དེ་ཡང་རིམ་བཞིན་དུ་བསོད་སྙོམས་ལ་བརྒྱུས་ནས་དེའི་ཁྱིམ་དུ་ཕྱིན་ཏོ།
en: He dressed in the morning, took his bowl and his robe, and entered Vārāṇasī for alms. The householder was then preparing his meal. Begging for alms, the self-awakened one arrived in due course at his house.

source: །ཁྱིམ་བདག་དེས་དེ་ལུས་མཛེས་ཤིང་སེམས་དང་བ་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བསམས་པ། འདི་བདག་གིས་ཟོས་ཀྱང་གདོན་མི་ཟ་བར་སྲོག་དང་འབྲལ་བར་འགྱུར་གྱིས།
en: When the householder saw him, whose body was attractive and whose mind was pure, he thought, ‘Even if I eat this now, I will certainly die.

source: མ་ལ་བདག་གི་སྐལ་བ་རབ་ཏུ་བྱུང་བ་འདི་ལ་སྦྱིན་ནོ་སྙམ་ནས་དེས་ཆུང་མ་ལ་སྨྲས་པ། བཟང་མོ་ཁོ་བོའི་སྐལ་བ་ནི་རབ་ཏུ་བྱུང་བ་འདི་ལ་དབུལ་ལོ། །དེས་བསམས་པ།
en: I will give my portion of this to this mendicant.’ He said to his wife, ‘Good lady, I will offer my portion to this mendicant.’

source: བདག་གི་ཁྱིམ་ཐབ་མི་ཟ་ན་བདག་གིས་ཅི་སྟེ་བཟའ་སྙམ་ནས། དེས་སྨྲས་པ། རྗེའི་སྲས་བདག་གི་སྐལ་བ་ཡང་འདི་ལ་དབུལ་ལོ།
en: “ ‘Why should I eat, while my husband does not?’ she thought, and she said, ‘My dear, I will also offer my portion to him.’

source: །དེ་བཞིན་དུ་བུ་དང་། མནའ་མ་དང་། བྲན་ཕོ་དང་། བྲན་མོས་ཀྱང་དཔྱད་ནས་རང་རང་གི་སྐལ་བ་ཡོངས་སུ་བཏང་སྟེ།
en: “His son, daughter-in-law, male slave, and female slave also considered likewise and gave up their portions.

source: དེ་ནས་དེ་ཐམས་ཅད་འདུས་ནས་རང་སངས་རྒྱས་ལ་བསོད་སྙོམས་ཕུལ་ལོ།
en: Thereupon they all met together and offered almsfood to the self-awakened one.

source: །བདག་ཉིད་ཆེན་པོ་དེ་དག་ནི་ལུས་ཀྱིས་ཆོས་སྟོན་གྱི་ཚིག་གིས་ནི་མ་ཡིན་པས་དེས་ངང་པའི་རྒྱལ་པོ་འདབ་མ་བརྐྱང་བ་ལྟར་སྟེང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་འབར་བ་དང་། གསལ་བ་དང་། ཆར་འབེབས་པ་དང་། གློག་འབྱིན་པའི་ཆོ་འཕྲུལ་དག་བྱ་བར་བརྩམས་སོ།
en: Since such great people do not show things by words but with their bodies, he soared high into the air as if a haṃsa king had stretched its wings to fly, and began to display miracles, namely, blazing fire, radiating light, causing rain to fall, and causing lightning to strike in their presence.

source: །སོ་སོའི་སྐྱེ་བོ་དག་ནི་རྫུ་འཕྲུལ་ལ་མྱུར་དུ་སེམས་གཏོད་པ་ཡིན་པས་ཤིང་རྩ་བ་ནས་བཅད་དེ་འགྱེལ་བ་བཞིན་དུ་རྐང་པ་གཉིས་ལ་གཏུགས་ནས་སྨོན་ལམ་ཅི་འདོད་པ་གདབ་པར་རྩོམ་སྟེ།
en: Since ordinary people tend to be swiftly attracted by magical powers, they bowed down to his feet like trees that had been cut at the roots and uttered their aspirations.

source: ཁྱིམ་བདག་གིས་སྨོན་ལམ་བཏབ་པ།
en: “The householder made this aspiration:

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་འདིས་བདག་གིས་གལ་ཏེ་བང་བ་དང་མཛོད་སྟོང་པ་དག་ལ་བལྟས་ན་མཐོང་བ་དེའི་མོད་ལ་གང་བར་གྱུར་ཅིག །འདི་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་ཐོབ་ནས་འདི་བས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་རྣམས་མཉེས་པར་བགྱིད་ཅིང་མི་མཉེས་པར་མི་བགྱིད་པར་གྱུར་ཅིག །ཆུང་མས་སྨོན་ལམ་བཏབ་པ།
en: ‘By this root of merit from my serving a man who is truly worthy of offerings, when I look at empty warehouses and storehouses, may they become full as soon as I look at them! Having attained such qualities, may I please a teacher who is nobler even than this man and not displease him!’ “The wife made this aspiration:

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་འདིས་བདག་གིས་གལ་ཏེ་གཅིག་ཅིག་གི་དོན་དུ་སྣོད་དུ་བཙོས་པ་དེ་བརྒྱའམ་སྟོང་གིས་ཟོས་ཀྱང་ཇི་སྲིད་བདག་གིས་སྦྱོར་བ་མ་བཏང་བའི་བར་དུ་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་ཞིང་། འདི་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་ཐོབ་ནས་འདི་བས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་རྣམས་མཉེས་པར་བགྱིད་ཅིང་མི་མཉེས་པར་མི་བགྱིད་པར་གྱུར་ཅིག །བུས་སྨོན་ལམ་བཏབ་པ།
en: ‘By this root of merit . . . , when I cook for one person, may the food be eaten by a hundred or a thousand people and never be exhausted until I stop preparing it . . . !’

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་འདིས་བདག་གི་རྐེད་པ་ལ་ལྔ་བརྒྱ་པའི་སྣོད་བཏགས་ཏེ་འདུག་པ་གལ་ཏེ་བརྒྱ་འམ་སྟོང་འགེད་པར་བཏང་ཡང་གང་བ་ཉིད་དུ་འདུག་སྟེ་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་ཞིང་། འདི་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་ཐོབ་ནས་འདི་བས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་རྣམས་མཉེས་པར་བགྱིད་ཅིང་མི་མཉེས་པར་མི་བགྱིད་པར་གྱུར་ཅིག །མནའ་མས་སྨོན་ལམ་བཏབ་པ།
en: “The son made this aspiration: ‘By this root of merit . . . , may a purse containing five hundred coins tied to my waist, when I spend a hundred or a thousand of them, become full just as it was and never become empty . . . !’ “The daughter-in-law made this aspiration:

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་འདིས། བདག་གིས་གལ་ཏེ་གཅིག་གི་ཕྱིར་དྲི་རྣམས་སྦྱར་ན་དེས་བརྒྱའམ་སྟོང་བྱུགས་ཀྱང་ཇི་སྲིད་སྦྱོར་བ་མ་བཏང་གི་བར་དུ་ཟད་པར་མི་འགྱུར་ཞིང་། འདི་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་ཐོབ་ནས་འདི་བས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་རྣམས་མཉེས་པར་བགྱིད་ཅིང་མི་མཉེས་པར་མི་བགྱིད་པར་གྱུར་ཅིག །བྲན་ཕོས་སྨོན་ལམ་བཏབ་པ།
en: ‘By this root of merit . . . , when I prepare incense for one person, may a hundred or a thousand people enjoy it and may it not be exhausted until I stop preparing it . . . !’ “Their male slave made this aspiration:

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་འདིས་བདག་གིས་གལ་ཏེ་ཞིང་རོལ་གཅིག་རྨོས་ན་རོལ་བདུན་རྨོས་པར་འགྱུར་ཞིང་། འདི་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་ཐོབ་ནས་འདི་བས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་རྣམས་མཉེས་པར་བགྱིད་ཅིང་མི་མཉེས་པར་མི་བགྱིད་པར་གྱུར་ཅིག །བྲན་མོས་སྨོན་ལམ་བཏབ་པ།
en: ‘By this root of merit . . . , when I plow one furrow in a field, may seven furrows be plowed . . . !’ “Their female slave made this aspiration:

source: བདག་གིས་ཡོན་གནས་དམ་པ་འདི་ལྟ་བུ་ལ་བྱ་བ་བྱས་པའི་དགེ་བའི་རྩ་བ་གང་ཡིན་པ་འདིས་བདག་གིས་གལ་ཏེ་སྣོད་གང་ཙམ་དྲུས་པ་གང་ཡིན་པ་དེས་སྣོད་བདུན་ཙམ་དུ་འཕེལ་བར་འགྱུར་ཞིང་། འདི་ལྟ་བུའི་ཆོས་རྣམས་ཀྱང་ཐོབ་ནས་འདི་བས་ཁྱད་པར་དུ་འཕགས་པའི་སྟོན་པ་རྣམས་མཉེས་པར་བགྱིད་ཅིང་མི་མཉེས་པར་མི་བགྱིད་པར་གྱུར་ཅིག །
en: ‘By this root of merit . . . , when I hull some grains in a vessel, may they fill seven vessels . . . !’

source: དེ་རྣམས་ཀྱིས་དེ་ལྟ་བུའི་སྨོན་ལམ་བཏབ་ནས་རང་སངས་རྒྱས་བདག་ཉིད་ཆེན་པོ་དེ་དེ་རྣམས་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་རྫུ་འཕྲུལ་གྱིས་ཆས་པ་དང་ཇི་ཙམ་ན་རྒྱལ་པོ་ཚངས་བྱིན་སྟེང་གི་ཁང་བཟངས་ཀྱི་གཞིར་སོང་སྟེ་འདུག་པ་ལས།
en: “When they had all made such aspirations, that great man, the self-awakened one, having entertained compassion for them, departed through his magical power. At that time, King Brahmadatta had gone up to the terrace and was sitting there.

source: རྫུ་འཕྲུལ་གྱིས་སོང་བའི་གྲིབ་མ་རྒྱལ་པོ་ཚངས་བྱིན་གྱི་སྟེང་དུ་བབས་ནས།
en: The shadow of the one flying with his magical power fell on King Brahmadatta.

source: དེས་གྱེན་དུ་བལྟ་བར་བརྩམས་པ་ལས་རང་སངས་རྒྱས་དེ་མཐོང་ནས་དེ་འདི་སྙམ་དུ་བདག་ཉིད་ཆེན་པོ་འདིའི་རྫུ་འཕྲུལ་གྱི་གཤོལ་ཆེན་པོས་ཡང་སུ་ཞིག་གི་བཀྲེན་པའི་དྲུངས་ཕྱུང་བར་གྱུར་སྙམ་མོ།
en: He looked up and saw the self-awakened one and wondered, ‘Whose root of poverty was removed by a large plow, which is this great man’s magical power?’

source: །དེ་ནས་ཁྱིམ་བདག་དེ་རེ་བ་ཆེན་པོས་མཛོད་དང་བང་མཛོད་རྣམས་ལ་བལྟས་པ་དང་། ཇི་ཙམ་ན་གང་བར་མཐོང་ངོ་།
en: “Thereafter, when that householder looked at his warehouses and storehouses with great hope, he saw them full.

source: །དེས་ཆུང་མ་ལ་སྨྲས་པ། རེ་ཞིག་ཁོ་བོའི་སྨོན་ལམ་ནི་རྫོགས་པར་གྱུར་གྱིས་ད་ཁྱེད་ཅག་གི་བལྟའོ། །དེ་ནས་བྲན་མོས་འབྲས་སྣོད་གང་ཙམ་དྲུས་ན་བདུན་ཙམ་དུ་འཕེལ་བར་གྱུར་ཏོ།
en: He said to his wife, ‘Since my wish has been fulfilled first, now we should see yours.’ Indeed, when the female slave hulled some grains in a mortar, they increased sevenfold.

source: །ཆུང་མས་གཅིག་གི་དོན་དུ་སྣོད་དུ་བཙོས་པ་ལ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཟོས་ཀྱང་དེ་ཁོ་ན་བཞིན་དུ་འདུག །ཉེ་འཁོར་གྱི་སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མས་ཟོས་ཀྱང་དེ་ཁོ་ན་བཞིན་དུ་འདུག་གོ།
en: When the wife cooked food in a pot for one person, it became food to be eaten by all of them, along with a thousand neighboring beings.

source: །དེ་ནས་ཁྱིམ་བདག་དེས་བཱ་རཱ་ཎ་སཱིར་དྲིལ་སྒྲོགས་སུ་བཅུག་པ།
en: “Thereupon the householder proclaimed with the ringing of bells in Vārāṇasī, ‘Sirs, whoever among you has a need should come!’ “There was then a loud, noisy cry in Vārāṇasī.

source: ཤེས་ལྡན་དག་ཁྱེད་ཅག་ལས་སུ་ཞིག་ཅི་དོན་དུ་གཉེར་བ་དེ་ཤོག་ཤིག །བཱ་རཱ་ཎ་སཱིར་སྒྲ་གསལ་བ་དང་སྒྲ་ཆེན་པོར་བྱུང་བ་རྒྱལ་པོས་ཐོས་ནས་དེས་སྨྲས་པ། ཤེས་ལྡན་དག་སྒྲ་གསལ་བ་དང་། སྒྲ་ཆེན་པོ་འདི་ཅི་ཞིག་ཡིན།
en: Upon hearing that, the king asked, ‘Sirs, what is this loud, noisy cry?’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་ཁྱིམ་བདག་ཆེ་གེ་མོ་ཞིག་ཅེས་བྱ་བས་མཛོད་དང་བང་བ་རྣམས་ཕྱེ་བ་ལགས་སོ།
en: “ ‘Your Majesty,’ his ministers replied, ‘a householder named So-and-so has opened his warehouses and storehouses.’

source: །རྒྱལ་པོས་སྨྲས་པ། གང་གི་ཚེ་འཇིག་རྟེན་ཐམས་ཅད་ཤི་ཟིན་པ་དེའི་ཚེ་ཁྱིམ་བདག་དེས་མཛོད་དང་བང་བ་རྣམས་ཕྱེའམ།
en: “ ‘Did the householder open his warehouses and storehouses only after everyone in the world has died?’ asked the king.

source: ཤེས་ལྡན་དག་ཁྱིམ་བདག་དེ་ཁུག་ཤིག །དེ་རྣམས་ཀྱིས་བཀུག་པ་དང་། དེ་ནས་རྒྱལ་པོས་སྨྲས་པ།
en: ‘Sirs, summon that householder.’

source: ཁྱིམ་བདག་གང་གི་ཚེ་འཇིག་རྟེན་ཐམས་ཅད་ཤི་ཟིན་པ་དེའི་ཚེ་ཁྱོད་ཀྱིས་མཛོད་དང་བང་བ་རྣམས་ཕྱེའམ།
en: “They summoned him, and then the king asked him, ‘Householder, did you open your warehouses and storehouses only after everyone in the world has died?’

source: ལྷ་སུའི་མཛོད་དང་བང་བ་རྣམས་ཕྱེ། འོན་ཀྱང་དེ་རིང་ཁོ་ནར་ས་བོན་སྩལ་བའི་འབྲས་བུ་དེ་ཉིད་དུ་གྲུབ་ལགས་སོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty, whose warehouses and storehouses were opened? (It is not the case that I opened my warehouses and storehouses after concealing foods there for a long time, but seeds sowed today bore fruit just today.)’

source: དེ་ཇི་ལྟ་བུ་ཞིག །དེས་སྐབས་དེ་རྒྱས་པར་སྨྲས་པ་དང་རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘What does that mean?’ demanded the king. “He then explained what had happened in detail.

source: ཁྱིམ་བདག་ཁྱོད་ཀྱིས་བདག་ཉིད་ཆེན་པོ་དེ་ལ་བསོད་སྙོམས་ཕུལ་ལམ།
en: The king asked, ‘Householder, did you offer a meal to that great man?’

source: ལྷ་བདག་གིས་ཕུལ་ལོ།
en: “ ‘Your Majesty, I did.’

source: །དེ་ཡང་ལྷག་པར་དད་པར་གྱུར་ནས། ཚིགས་སུ་བཅད་པས་སྨྲས་པ།
en: “He became more pious and spoke a verse:

source: ཀྱེ་མའོ་ཡོན་ཏན་ལས་བྱུང་བའི།
en: “How great the field is, which was

source: །སྐྱོན་ཀུན་རྣམ་པར་སྤངས་པའི་ཞིང་།
en: Born from merit and is free from all faults—

source: །དེ་ལ་ས་བོན་བཏབ་པ་ཡི།
en: From seeds sowed there,

source: །འབྲས་བུ་དེ་ཉིད་ཐོབ་པར་གྱུར།
en: Fruit was harvested just today.

source: ཁྱིམ་བདག་དང་། ཁྱིམ་བདག་གི་ཆུང་མ་དང་། ཁྱིམ་བདག་གི་བུ་དང་། ཁྱིམ་བདག་གི་མནའ་མ་དང་། ཁྱིམ་བདག་གི་བྲན་ཕོ་དང་། ཁྱིམ་བདག་གི་བྲན་མོ་གང་ཡིན་པ་དེ་ནི་ཁྱིམ་བདག་ལུག་དང་། ལུག་གི་ཆུང་མ་དང་། ལུག་གི་བུ་དང་། ལུག་གི་མནའ་མ་དང་། ལུག་གི་བྲན་ཕོ་དང་། ལུག་གི་བྲན་མོ་འདི་དག་ཉིད་ཡིན་ནོ།
en: The householder and his wife, son, daughter-in-law, male slave, and female slave were indeed this householder Miṇḍhaka and his wife, son, daughter-in-law, male slave, and female slave.

source: །འདི་དག་གིས་རང་སངས་རྒྱས་ལ་བྱ་བ་བྱས་ཤིང་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པ་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་དྲུག་ཆར་ཡང་བསོད་ནམས་ཆེན་པོར་གྱུར་ཅིང་ངའི་སྤྱན་སྔར་བདེན་པ་མཐོང་ཞིང་། རང་སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་པས་ཆེས་ཁྱད་པར་འཕགས་པའི་སྟོན་པ་ང་མཉེས་པར་བྱས་ཀྱི།
en: Because of the maturation of that karma, namely, their performing services for a self-awakened one and making aspirations, these six became possessors of great merit, saw the truth in my presence, who is a teacher nobler than a hundred billion self-awakened ones.

source: མི་མཉེས་པར་ནི་མ་ཡིན་ནོ།
en: They pleased me and did not displease me.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན། ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative;

source: གཅིག་ཏུ་དཀར་བ་རྣམས་ཀྱི་ནི་གཅིག་ཏུ་དཀར་བ་ཡིན་པས་ཞེས་བྱ་བ་ནས་བརྩལ་བར་བྱ་སྟེ།
en: the maturation of entirely positive actions is entirely positive . . . you should seek . . . .

source: དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟ་བུ་ལ་བསླབ་པར་བྱའོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།། །།
en: Monks, that is how you must train.” Chapter Eleven

source: ཀེ་ནའི་བུ་ཡིས་བཏུང་བ་བླངས།
en: The Drink Offered by Kaineya Was Received, The Town of Kāśi, Barley Porridge,

source: །ཀ་ཤིའི་ཚོང་རྡལ་ནས་ཐུག་དང་། །སྡིག་ཅན་དུ་ནི་བཅའ་བ་དང་། །འགྱོད་དང་སྦྱར་བའི་ཟས་དག་གོ།
en: Khādyaka in Pāpā, Doubts, and Foul Foods. I. The Drink Offered by Kaineya Was Received A. The Conversion of Kaineya and Śaila (Prose)

source: །བཅོམ་ལྡན་འདས་ཡུལ་ཨ་དུ་མའི་གནས་ན་བཞུགས་སོ།
en: The Blessed One was once staying in the dwelling place in Ādumā. 1. The Sermon to the Four Great Kings

source: །དེའི་ཚེ་དྲང་སྲོང་ཀེ་ནའི་བུ་གནས་ནི་ཡུལ་ཨ་དུ་མ་ན་འདུག་གོ། །ཉིན་པར་ནི་རྫིང་བུ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་ན་གནས་སོ།
en: At that time, the ṛṣi Kaineya had his dwelling place in Ādumā and was spending the day on the bank of Mandākinī Lotus Pond.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ། ངས་གང་དུ་འཇིག་རྟེན་སྐྱོང་བ་བཞི་རྣམས་ལ་ཆོས་བཤད་ན་དེར་ངས་ཚེགས་ཆུང་ངུས་དྲང་སྲོང་ཀེ་ནའི་བུ་ཐུལ་བར་འགྱུར་སྙམ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། མ་ལ་ངས་རྫིང་བུ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་བཤད་ན་དེར་ཐུལ་བར་འགྱུར་རོ་སྙམ་མོ།
en: The Blessed One asked himself, “Where should I preach the Dharma to the Four Protectors of the World in order to convert the ṛṣi Kaineya with little effort?” Then the Blessed One understood, “If I preach the Dharma on the bank of Mandākinī Lotus Pond, there he will be converted.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་དེ་ཆོས་ཉིད་ཀྱིས་གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་པ་དེའི་ཚེ་བརྒྱ་བྱིན་དང་ཚངས་པ་ལ་སོགས་ཏེ་ལྷ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱི་དགོངས་པ་སེམས་ཀྱིས་ཤེས་པར་འགྱུར་བས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས་བསམས་པ།
en: Thereupon the Blessed One entertained mundane thoughts. It naturally occurs that when the buddhas, the blessed ones, entertain mundane thoughts, Śakra, Brahmā, and other gods understand the Blessed One’s thoughts.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ཞིག་གི་ཕྱིར་འཇིག་རྟེན་པའི་ཐུགས་བསྐྱེད་པ་མཛད་པ་བལྟས་ན། བདག་ཅག་འཇིག་རྟེན་སྐྱོང་བ་བཞི་རྣམས་ཁོ་ན་ལ་ཆོས་བཤད་པར་བཞེད་དོ་སྙམ་དུ་རིག་ནས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལྔས་རྩེན་ལ་བསྒོ་བ་ལྔས་རྩེན་སོང་ལ་རྫིང་བུ་དལ་གྱི་འབབ་ཀྱི་འགྲམ་དུ་བཅོམ་ལྡན་འདས་ཀྱི་གདན་ཤོམས་ཏེ།
en: Great King Vaiśravaṇa asked himself, “For the sake of what did the Blessed One entertain mundane thoughts?” He then realized, “He wishes to preach the Dharma to us, the Four Protectors of the World.” Having realized this, he ordered Pāñcika, the great general of the yakṣas, “Pāñcika, go and prepare a seat for the Blessed One on the bank of Mandākinī Lotus Pond.

source: འདུས་པ་ཆེན་པོ་འདུས་པ་ན་སུས་ཀྱང་དེའི་མདངས་འཕྲོགས་པར་མི་འགྱུར་བར་དྲང་སྲོང་ཀེ་ནའི་བུའི་སྲུང་མ་གཅིག་ཀྱང་སྐོས་ཤིག །དེས་རྫིང་བུ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་དྲང་སྲོང་ཀེ་ནའི་བུའི་སྲུང་མ་བཞག་ནས་གནས་ཤོམ་པར་རྩོམ་པ་ན་དེ་ན་སྐྱེ་བོའི་ཚོགས་ཆེན་པོའི་ཅ་ཅོའི་སྒྲ་བྱུང་བ་དང་། དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུ་ཅ་ཅོའི་སྒྲས་ལངས་ནས་སྲུང་མ་དེ་ལ་དྲིས་པ།
en: Install a guard for the ṛṣi Kaineya so that no one will spoil his luster when there is a large assemblage.” Having installed a guard for the ṛṣi Kaineya on the bank of Mandākinī Lotus Pond, he was preparing a seat for the Blessed One when the sound of many people arose.

source: ཅ་ཅོའི་སྒྲ་འདི་ཅི་ཞིག་དེས་སྨྲས་པ།
en: Because of the noise, the ṛṣi Kaineya stood up and asked the guard, “What is this noise?”

source: གདན་ཤོམ་པར་བྱེད་པའིའོ།
en: “They are preparing a seat,” he answered.

source: །ཅི་ཁོ་བོའི་ཕྱིར་རམ།
en: “Is that for me?”

source: ཁྱོད་ཀྱི་ཕྱིར་ནི་མ་ཡིན་མོད་ཀྱི་འོན་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ཡིན་ནོ།
en: “It is not for you, but for the Buddha, the Blessed One.”

source: །ཁྱོད་འདི་ན་ཅི་ཞིག་ལ་སྡོད།
en: “Why are you here?”

source: ཁྱོད་ཁོ་ན་སྲུང་ངོ་།
en: “To guard none but you.”

source: །ཅིའི་ཕྱིར་འབྱུང་པོ་མང་པོ་འདུ་བར་འགྱུར་བས་སོ།
en: “Why?” “Because there will be a large assemblage.”

source: །དེས་སྨྲས་པ། དགེ་སྦྱོང་གཽ་ཏ་མ་དེ་སུ་ཞིག་གིས་སྲུང་བར་བྱེད་པར་འགྱུར།
en: The ṛṣi asked, “Who will guard that śramaṇa Gautama?”

source: དེས་སྨྲས་པ། བཅོམ་ལྡན་འདས་དེ་ལ་སུ་ཞིག་སྲུང་།
en: “Who could guard that Blessed One?” answered the guard.

source: བཅོམ་ལྡན་འདས་དེ་ཉིད་ནི་འཇིག་རྟེན་ལྷ་དང་བཅས་པའི་སྲུང་མ་མཛད་དོ་ཞེས་བྱས་པ་དང་དྲང་སྲོང་ཀེ་ནའི་བུས་ཐོས་ནས་ཅང་མི་སྨྲའོ།
en: “The Blessed One himself is the guard of the world including gods.” When he heard this, the ṛṣi Kaineya remained silent.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་མནབས་ལྷུང་བཟེད་དང་ཆོས་གོས་བསྣམས་ནས་ཨ་དུ་མར་བསོད་སྙོམས་ལ་ཞུགས་ཏེ།
en: The Blessed One then dressed in the morning, took his bowl and his robe, and entered Ādumā for alms.

source: ཨ་དུ་མར་བསོད་སྙོམས་སྤྱད་ནས་ཟས་ཀྱི་བྱ་བ་མཛད་དེ།
en: After having begged for food, he had his meal.

source: ཟས་ཕྱི་མའི་བསོད་སྙོམས་སྤངས་ནས་ཇི་ལྟར་ཐུགས་མཉམ་པར་བཞག་ན་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཨ་དུ་མ་ནས་མི་སྣང་བར་གྱུར་ཏེ། རྫིང་བུ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་བྱོན་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: Afterward he returned, settled his mind, and entered a state of meditation by which he disappeared from Ādumā with the community of monks and appeared on the bank of Mandākinī Lotus Pond.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: The Blessed One then sat on the seat prepared for him in front of the community of monks.

source: །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྐྱོང་དྲི་ཟ་དུ་མའི་འཁོར་དང་། དྲི་ཟ་བརྒྱ་ཕྲག་དུ་མའི་འཁོར་དང་། དྲི་ཟ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། དྲི་ཟ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། ལྷའི་ནོར་བུས་ཐུ་བ་བཀང་སྟེ།
en: Then Great King Dhṛtarāṣṭra with many attendants—hundreds, thousands, hundreds of thousands of them, all of whom were gandharvas—went to the Blessed One, with the front part of his garment filled with divine jewels.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ལྷའི་ནོར་བུ་རྣམས་ཀྱིས་གཏོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་མདུན་གྱིས་བལྟས་ནས་ཤར་ཕྱོགས་སུ་བརྟེན་ཏེ་འདུག་གོ།
en: When he arrived, he scattered the divine jewels for the Blessed One, bowed low until his forehead touched the Blessed One’s feet, then sat to the east, attending the Blessed One and the community of monks.

source: །རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ཡང་གྲུལ་བུམ་དུ་མའི་འཁོར་དང་། གྲུལ་བུམ་བརྒྱ་ཕྲག་དུ་མའི་འཁོར་དང་། གྲུལ་བུམ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། གྲུལ་བུམ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། ལྷའི་མུ་ཏིག་གིས་ཐུ་བ་བཀང་སྟེ།
en: Great King Virūḍhaka, too, with many hundreds and thousands—hundreds of thousands—of attendants, all of whom were kumbhāṇḍas, went to the Blessed One, with the front part of his garment filled with divine pearls.
